#CH5 矩陣、陣列
#矩陣-使用 matrix() 函數來建立

# 建立一個2列3行的矩陣，數據為1到6


# 建立一個3列2行的矩陣，數據為1到6


#以列為主排列數據


#更改名稱


#陣列-使用 array() 函數來建立

#建立一個3*3*2的三維陣列



#更改名稱




#向量、矩陣、陣列、列表之差異
#向量（vector）：用於一維且沒有維度屬性

#查看向量的長度

#矩陣（matrix）：用於二維，有維度屬性，可看成二維陣列

# 查看矩陣的維度

#陣列（array）：可用於所有維度，有維度屬性

#列表（list）:列表中的元素可以是任意類型的數據

#顯示列表的結構

#查詢是否為陣列 使用is.array()


#查詢屬性 使用attributes()


#基本運算







#以row形式結合2向量


#以column形式結合2向量



#索引





#練習
#1.	請建立一個2列3行的矩陣(擺放6個資料)，將資料”數字7~12”進行以列為主的排列。

#2.	有3個人到了超市買了不同數量的香蕉(以b表示)和蘋果(以a表示):
     # Tom買了5個蘋果和4個香蕉，Mary買了14個蘋果和6個香蕉，Eve買了0個蘋果和0個香蕉(純粹去逛超市的)
     # 請建立一個2列3行的矩陣來表示上列的資訊。



#3.	將上列(問題2.)的式子改以3列2行表示。



#4.	已知向量a(1,2,3,4,5)，向量b(5,4,3,2,1)，請試著用rbind和cbind來結合他們。




